DeviceInfo
| distinct MachineGroup, DeviceId, DeviceName, OSPlatform
//| where MachineGroup in ("Oxford University Hospitals", "Oxford University Hospitals (Server)")
| where MachineGroup in ("Department of Health and Social Care")
| where OSPlatform <> ""
| join kind=inner
(
    DeviceImageLoadEvents
    | where InitiatingProcessFileName in ("avp.exe", "savservice.exe", "hmpalert.exe", "TmCCSF.exe", "ntrtscan.exe", "isxagent.exe", "isxagent64.exe", "mfeesp.exe", "mcshield.exe", "mcdatrep.exe")
    | extend 3rdprtyAV = case(InitiatingProcessFileName =~ ("avp.exe"), "Kaspersky",
        InitiatingProcessFileName =~ ("savservice.exe"), "Sophos AV",
        InitiatingProcessFileName =~ ("hmpalert.exe"), "Sophos Hitman Pro",
        InitiatingProcessFileName =~ ("tmCCSF.exe"), "Trend Office Scan",
        InitiatingProcessFileName =~ ("ntrtscan.exe"), "Trend AV Component",
        InitiatingProcessFileName =~ ("isxagent.exe"), "Ivanti",
        InitiatingProcessFileName =~ ("isxagent64.exe"), "Ivanti 64-bit",
        InitiatingProcessFileName =~ ("mfeesp.exe"), "McAfee Endpoint Security",
        InitiatingProcessFileName =~ ("mcshield.exe"), "McAfee AV",
        InitiatingProcessFileName =~ ("mcdatrep.exe"), "McAfee Virus Definitions",             
      "Unknown")
    | distinct 3rdprtyAV, DeviceId, InitiatingProcessFileName
)
on DeviceId
| summarize Devices = dcount(DeviceName) by MachineGroup, 3rdprtyAV, InitiatingProcessFileName, OSPlatform


DeviceInfo
// | where RegistryDeviceTag == "YDDAQ"
// | where MachineGroup =~ "Bedford Hospital" 
| where Timestamp > ago (7d)
| distinct RegistryDeviceTag, MachineGroup, DeviceId, DeviceName
| join kind=inner
(
    DeviceFileEvents
    | where InitiatingProcessFileName !in~ ("winword.exe", "outlook.exe", "explorer.exe")
    | where FileName has ".doc" or FileName has ".docx"
    | distinct DeviceId, InitiatingProcessFileName, InitiatingProcessCommandLine, FileName
)
on DeviceId
| summarize Instances = count(DeviceName) by RegistryDeviceTag, MachineGroup, InitiatingProcessFileName
// | take 1000
